bench/profile/audits/2026-04-27-h1-wrk-main.txt
Running 30s test @ http://127.0.0.1:8080/baseline2?a=1&b=2
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.96ms    3.24ms  56.22ms   97.01%
    Req/Sec    24.86k     4.51k   41.84k    94.50%
  2969619 requests in 30.08s, 178.42MB read
Requests/sec:  98722.06
Transfer/sec:      5.93MB